// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.Write("введите любое трёхзначное число");
string username = Console.ReadLine();
int[] array = new int[2];

//int num = Convert.ToInt32(Console.ReadLine());
//int lengt = num.ToString().Length;

//if (lengt < 3 || lengt > 3)
//    Console.WriteLine("Вы ввели не трехзначное число");
//else
//   Console.WriteLine(InCenter(num));


